# StructuralSectionStructuralTees Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionStructuralTees Class
Members See Also
---
Defines parameters for Structural Tees structural section.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class StructuralSectionStructuralTees : StructuralSectionGeneralT
```

Visual Basic
---
```text
Public Class StructuralSectionStructuralTees _
	Inherits StructuralSectionGeneralT
```

Visual C++
---
```text
public ref class StructuralSectionStructuralTees : public StructuralSectionGeneralT
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangular Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionHotRolled Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralT Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionStructuralTees
# See Also
StructuralSectionStructuralTees Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace